In [208]:
import pandas as pd
import os

cwd = os.getcwd()
print(cwd)

schools = "../Starter_Code/PyCitySchools/Resources/schools_complete.csv"
students = "../Starter_Code/PyCitySchools/Resources/students_complete.csv"

C:\Users\Saman\Python_Practice\Pandas-Challenge\PyCitySchools

In [209]:
schools_df = pd.read_csv(schools)
schools_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [211]:
students_df = pd.read_csv(students)
students_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [213]:
school_data_combined = pd.merge(students_df, schools_df, how="left", on=["school_name","school_name"])
school_data_combined.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [214]:
school_data_combined.to_csv("School_Data_Combined.csv")

In [215]:
school_count = len(school_data_combined["school_name"].unique())
school_count

15

In [216]:
student_count = school_data_combined["student_name"].count()
student_count

39170

In [217]:
total_budget = schools_df["budget"].sum()
total_budget

24649428

In [218]:
avg_math_score = school_data_combined["math_score"].mean()
avg_math_score

78.98537145774827

In [219]:
avg_reading_score = school_data_combined["reading_score"].mean()
avg_reading_score

81.87784018381414

In [220]:
passing_math_count = school_data_combined[(school_data_combined["math_score"] >= 70)].count()["student_name"]
passing_math_percent = (passing_math_count / student_count) * 100
passing_math_percent

74.9808526933878

In [221]:
passing_reading_count = school_data_combined[(school_data_combined["reading_score"] >= 70)].count()["student_name"]
passing_reading_percent = (passing_reading_count / student_count) * 100
passing_reading_percent

85.80546336482001

In [222]:
overall_passing_count = school_data_combined[(school_data_combined["math_score"] >= 70) & (school_data_combined["reading_score"] >= 70)].count()["student_name"]
overall_passing_percent = (overall_passing_count / student_count) * 100
overall_passing_percent

65.17232575950983

In [223]:
district_summary_df = pd.DataFrame(
    {"Total number of unique schools": [school_count],
    "Total students": [student_count],
    "Total budget": [total_budget],
    "Average math score": [avg_math_score],
    "Average reading score": [avg_reading_score],
    "Passing math %": [passing_math_percent],
    "Passing reading %": [passing_reading_percent],
    "Passing overall %": [overall_passing_percent]})

district_summary_df["Total students"] = district_summary_df["Total students"].map("{:,}".format)
district_summary_df["Total budget"] = district_summary_df["Total budget"].map("${:,.2f}".format)
district_summary_df["Average math score"] = district_summary_df["Average math score"].map("{:,.2f}".format)
district_summary_df["Average reading score"] = district_summary_df["Average reading score"].map("{:,.2f}".format)
district_summary_df["Passing math %"] = district_summary_df["Passing math %"].map("{:,.2f}%".format)
district_summary_df["Passing reading %"] = district_summary_df["Passing reading %"].map("{:,.2f}%".format)
district_summary_df["Passing overall %"] = district_summary_df["Passing overall %"].map("{:,.2f}%".format)

district_summary_df

,Total number of unique schools,Total students,Total budget,Average math score,Average reading score,Passing math %,Passing reading %,Passing overall %
0,15,"39,170","$24,649,428.00",78.99,81.88,74.98%,85.81%,65.17%

In [224]:
district_summary_df.to_csv("District Summary.csv")

In [267]:
schools_df_updated = schools_df
schools_df_updated = schools_df_updated.drop(columns = ["School ID"])
schools_df_updated.head()

             school_name      type  size   budget
0      Huang High School  District  2917  1910635
1   Figueroa High School  District  2949  1884411
2    Shelton High School   Charter  1761  1056600
3  Hernandez High School  District  4635  3022020
4    Griffin High School   Charter  1468   917500

In [282]:
schools_df_updated["Per student budget"] = schools_df_updated["budget"] / schools_df_updated["size"]

In [283]:
schools_df_updated.head()

             school_name      type  size   budget  Per student budget
0      Huang High School  District  2917  1910635               655.0
1   Figueroa High School  District  2949  1884411               639.0
2    Shelton High School   Charter  1761  1056600               600.0
3  Hernandez High School  District  4635  3022020               652.0
4    Griffin High School   Charter  1468   917500               625.0

In [287]:
school_avg_math_score = school_data_combined.groupby("school_name")["math_score"].mean()
school_avg_reading_score = school_data_combined.groupby("school_name")["reading_score"].mean()

In [288]:
schools_df_updated_math = pd.merge(schools_df_updated, school_avg_math_score, how="left", on=["school_name","school_name"])
schools_df_summary = pd.merge(schools_df_updated_math, school_avg_reading_score, how="left", on=["school_name","school_name"])

In [297]:
schools_df_summary.head()

,school_name,type,size,budget,Per student budget,math_score,reading_score
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724
3,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757

In [298]:
passing_math_count_byschool = school_data_combined[(school_data_combined["math_score"] >= 70)]
passing_math_count_byschool_groupby = passing_math_count_byschool.groupby("school_name")["math_score"].count()
passing_math_count_byschool_groupby

school_name
Bailey High School       3318
Cabrera High School      1749
Figueroa High School     1946
Ford High School         1871
Griffin High School      1371
Hernandez High School    3094
Holden High School        395
Huang High School        1916
Johnson High School      3145
Pena High School          910
Rodriguez High School    2654
Shelton High School      1653
Thomas High School       1525
Wilson High School       2143
Wright High School       1680
Name: math_score, dtype: int64

In [308]:
passing_reading_count_byschool = school_data_combined[(school_data_combined["reading_score"] >= 70)]
passing_reading_count_byschool_groupby = passing_reading_count_byschool.groupby("school_name")["reading_score"].count()
passing_reading_count_byschool_groupby

school_name
Bailey High School       4077
Cabrera High School      1803
Figueroa High School     2381
Ford High School         2172
Griffin High School      1426
Hernandez High School    3748
Holden High School        411
Huang High School        2372
Johnson High School      3867
Pena High School          923
Rodriguez High School    3208
Shelton High School      1688
Thomas High School       1591
Wilson High School       2204
Wright High School       1739
Name: reading_score, dtype: int64

In [302]:
schools_df_summary_v1 = pd.merge(schools_df_summary, passing_math_count_byschool_groupby, how="left", on=["school_name","school_name"])
schools_df_summary_v2 = pd.merge(schools_df_summary_v1, passing_reading_count_byschool_groupby, how="left", on=["school_name","school_name"])

In [315]:
overall_passing_count_byschool = school_data_combined[(school_data_combined["math_score"] >= 70) & (school_data_combined["reading_score"] >= 70)]
overall_passing_count_byschool_groupby = overall_passing_count_byschool.groupby("school_name").count()["student_name"]
overall_passing_count_byschool_groupby

school_name
Bailey High School       2719
Cabrera High School      1697
Figueroa High School     1569
Ford High School         1487
Griffin High School      1330
Hernandez High School    2481
Holden High School        381
Huang High School        1561
Johnson High School      2549
Pena High School          871
Rodriguez High School    2119
Shelton High School      1583
Thomas High School       1487
Wilson High School       2068
Wright High School       1626
Name: student_name, dtype: int64

In [316]:
schools_df_summary_v3 = pd.merge(schools_df_summary_v2, overall_passing_count_byschool_groupby, how="left", on=["school_name","school_name"])

In [317]:
schools_df_summary_v3.head()

,school_name,type,size,budget,Per student budget,math_score_x,reading_score_x,math_score_y,reading_score_y,% passing math,% passing reading,student_name
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,0.656839,0.813164,1561
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,0.659885,0.807392,1569
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,0.938671,0.958546,1583
3,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,3094,3748,0.667530,0.808630,2481
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,1371,1426,0.933924,0.971390,1330

In [318]:
schools_df_summary_v3["% passing math"] = schools_df_summary_v3["math_score_y"] / schools_df_summary_v3["size"]
schools_df_summary_v3["% passing reading"] = schools_df_summary_v3["reading_score_y"] / schools_df_summary_v3["size"]
schools_df_summary_v3["% overall passing"] = schools_df_summary_v3["student_name"] / schools_df_summary_v3["size"]

In [320]:
schools_df_summary_v3.head()

,school_name,type,size,budget,Per student budget,math_score_x,reading_score_x,math_score_y,reading_score_y,% passing math,% passing reading,student_name,% overall passing
0,Huang High School,District,2917,1910635,655.0,76.629414,81.182722,1916,2372,0.656839,0.813164,1561,0.535139
1,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,1946,2381,0.659885,0.807392,1569,0.532045
2,Shelton High School,Charter,1761,1056600,600.0,83.359455,83.725724,1653,1688,0.938671,0.958546,1583,0.898921
3,Hernandez High School,District,4635,3022020,652.0,77.289752,80.934412,3094,3748,0.667530,0.808630,2481,0.535275
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,1371,1426,0.933924,0.971390,1330,0.905995